In [1]:
import numpy as np
import pandas as pd
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a','b','c','d', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to rename a specific column name in a given DataFrame

In [2]:
df = df.rename(columns={'score':'col2'})
df

        name  col2  attempts qualify
a  Anastasia  12.5         1     yes
b       Dima   9.0         3      no
c  Katherine  16.5         2     yes
d      James   NaN         3      no
e      Emily   9.0         2      no
f    Michael  20.0         3     yes
g    Matthew  14.5         1     yes
h      Laura   NaN         1      no
i      Kevin   8.0         2      no
j      Jonas  19.0         1     yes

Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers

In [3]:
A = np.array([("Aji",22,"Karawang","Data Scientist/Entepreneur/CEO"),("Rika",22,"Karawang","Medical Doctor")])
index = ['person '+str(i) for i in range(1,len(A)+1)]
dA = pd.DataFrame(A, columns=['Nama','Umur','Alamat','Job'], index=index)
print(dA)

          Nama Umur    Alamat                             Job
person 1   Aji   22  Karawang  Data Scientist/Entepreneur/CEO
person 2  Rika   22  Karawang                  Medical Doctor

Write a Pandas program to find the row for where the value of a given column is maximum

In [4]:
colmax1 = df['col2'].idxmax()
colmax2 = df['attempts'].idxmax()
print("index where max values of col score ",colmax1)
print("index where max values of col attempts", colmax2)

index where max values of col score  f
index where max values of col attempts b

Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [5]:
if 'col2' in df.columns:
  print("col2 is present in DataFrame.")
else:
  print("col2 is not present in DataFrame.")

col2 is present in DataFrame.

Write a Pandas program to get the datatypes of columns of a DataFrame

In [6]:
df.info()
print()
df.dtypes

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
col2        8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

name         object
col2        float64
attempts      int64
qualify      object
dtype: object

In [7]:
da = pd.DataFrame()
la = [1,2,3,4,5]
data = pd.DataFrame({"col1": la,"col2": la})
da = da.append(data)
print(da)

   col1  col2
0     1     1
1     2     2
2     3     3
3     4     4
4     5     5

Write a Pandas program to sort a given DataFrame by two or more columns. Go to the editor
Sample data

In [8]:
df.sort_values(['attempts', 'name'], ascending=[True, True])

        name  col2  attempts qualify
a  Anastasia  12.5         1     yes
j      Jonas  19.0         1     yes
h      Laura   NaN         1      no
g    Matthew  14.5         1     yes
e      Emily   9.0         2      no
c  Katherine  16.5         2     yes
i      Kevin   8.0         2      no
b       Dima   9.0         3      no
d      James   NaN         3      no
f    Michael  20.0         3     yes

Write a Pandas program to convert the datatype of a given column (floats to ints)

In [9]:
print(df.dtypes)
df['col2'] = df.col2.fillna(0)
df.col2 = df.col2.astype(int)
print()
print(df.dtypes)
df.head()

name         object
col2        float64
attempts      int64
qualify      object
dtype: object

name        object
col2         int64
attempts     int64
qualify     object
dtype: object

        name  col2  attempts qualify
a  Anastasia    12         1     yes
b       Dima     9         3      no
c  Katherine    16         2     yes
d      James     0         3      no
e      Emily     9         2      no

Write a Pandas program to remove infinite values from a given DataFrame.

In [10]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)
print("Removing infinite values:")
df = df.replace([np.inf, -np.inf], np.nan)
print(df)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN